issaccheng2008/test_map_widget/esp32_webserver/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning  // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);  // codespell:ignore totaly
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static const char *skip_whitespace(const char *ptr) {
  while (ptr && *ptr && isspace((unsigned char)*ptr)) {
    ++ptr;
  }
  return ptr;
}

static const char *find_json_value_start(const char *body, const char *field_name) {
  if (!body || !field_name) {
    return NULL;
  }

  const char *marker = strstr(body, field_name);
  if (!marker) {
    return NULL;
  }

  marker = strchr(marker, ':');
  if (!marker) {
    return NULL;
  }

  ++marker;
  return skip_whitespace(marker);
}

static esp_err_t gps_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  char payload[96];
  const int len = snprintf(payload, sizeof(payload), "{\"latitude\":%.6f,\"longitude\":%.6f}", g_simulatedLatitude, g_simulatedLongitude);
  if (len < 0) {
    return httpd_resp_send_500(req);
  }

  return httpd_resp_send(req, payload, len);
}

static esp_err_t file_upload_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  const size_t total_len = req->content_len;
  if (total_len == 0) {
    const char *response = "{\"status\":\"error\",\"message\":\"empty body\"}";
    return httpd_resp_send(req, response, strlen(response));
  }

  char *body = (char *)malloc(total_len + 1);
  if (!body) {
    return httpd_resp_send_500(req);
  }

  size_t received = 0;
  while (received < total_len) {
    const int ret = httpd_req_recv(req, body + received, total_len - received);
    if (ret <= 0) {
      free(body);
      return httpd_resp_send_500(req);
    }
    received += ret;
  }
  body[total_len] = '\0';

  char type_value[16] = {0};
  const char *type_start = find_json_value_start(body, "\"type\"");
  if (type_start && *type_start == '\"') {
    ++type_start;
    size_t index = 0;
    while (*type_start && *type_start != '\"' && index < sizeof(type_value) - 1) {
      type_value[index++] = *type_start++;
    }
    type_value[index] = '\0';
  }

  const char *content_start = find_json_value_start(body, "\"content\"");
  if (!content_start) {
#if defined(ARDUINO_ARCH_ESP32)
    Serial.println(F("JSON payload missing content field"));
    Serial.flush();
#else
    log_w("JSON payload missing content field");
#endif
    free(body);
    const char *response = "{\"status\":\"error\",\"message\":\"missing content\"}";
    return httpd_resp_send(req, response, strlen(response));
  }

  const bool treat_as_file = (type_value[0] == '\0') || (strcmp(type_value, "file") == 0);
  if (treat_as_file) {
    if (*content_start != '\"') {
#if defined(ARDUINO_ARCH_ESP32)
      Serial.println(F("Unexpected content format for file payload"));
      Serial.flush();
#else
      log_w("Unexpected content format for file payload");
#endif
    } else {
      ++content_start;
      char *decoded = (char *)malloc(total_len + 1);
      if (decoded) {
        size_t decoded_index = 0;
        bool escape = false;
        for (const char *cursor = content_start; *cursor != '\0'; ++cursor) {
          if (!escape && *cursor == '\"') {
            break;
          }

          if (escape) {
            switch (*cursor) {
              case '\"':
                decoded[decoded_index++] = '\"';
                break;
              case '\\':
                decoded[decoded_index++] = '\\';
                break;
              case 'n':
                decoded[decoded_index++] = '\n';
                break;
              case 'r':
                decoded[decoded_index++] = '\r';
                break;
              case 't':
                decoded[decoded_index++] = '\t';
                break;
              default:
                decoded[decoded_index++] = *cursor;
                break;
            }
            escape = false;
            continue;
          }

          if (*cursor == '\\') {
            escape = true;
            continue;
          }

          decoded[decoded_index++] = *cursor;
        }

        decoded[decoded_index] = '\0';
#if defined(ARDUINO_ARCH_ESP32)
        Serial.println(F("Received GPX content:"));
        Serial.println(decoded);
        Serial.flush();
#else
        log_i("Received GPX content:\n%s", decoded);
#endif
        free(decoded);
      } else {
        log_w("Failed to allocate buffer for decoded content");
      }
    }
  } else if (strcmp(type_value, "pathinfo") == 0) {
    if (*content_start != '[') {
#if defined(ARDUINO_ARCH_ESP32)
      Serial.println(F("Unexpected content format for path info payload"));
      Serial.flush();
#else
      log_w("Unexpected content format for path info payload");
#endif
    } else {
      const char *cursor = content_start;
      int bracket_depth = 0;
      bool in_string = false;

      while (*cursor) {
        char c = *cursor;
        if (in_string) {
          if (c == '\\' && cursor[1] != '\0') {
            cursor += 2;
            continue;
          }
          if (c == '\"') {
            in_string = false;
          }
        } else {
          if (c == '\"') {
            in_string = true;
          } else if (c == '[') {
            ++bracket_depth;
          } else if (c == ']') {
            --bracket_depth;
            if (bracket_depth == 0) {
              ++cursor;
              break;
            }
          }
        }
        ++cursor;
      }

      const size_t length = cursor - content_start;
      char *content_copy = (char *)malloc(length + 1);
      if (content_copy) {
        memcpy(content_copy, content_start, length);
        content_copy[length] = '\0';
#if defined(ARDUINO_ARCH_ESP32)
        Serial.println(F("Received path info (including heading):"));
        Serial.println(content_copy);
        Serial.flush();
#else
        log_i("Received path info (including heading):\n%s", content_copy);
#endif
        free(content_copy);
      } else {
        log_w("Failed to allocate buffer for path info content");
      }
    }
  } else {
#if defined(ARDUINO_ARCH_ESP32)
    Serial.print(F("Unknown payload type: "));
    Serial.println(type_value);
    Serial.flush();
#else
    log_w("Unknown payload type: %s", type_value);
#endif
  }

